// See https://aka.ms/new-console-template for more information
Console.WriteLine("Напишите программу, которая принимает на вход три числа\r\nи выдаёт максимальное из этих чисел.\r\n");
